---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceZeroLengthSplittingCurve
source: html/626e7993-fe15-b8ba-26c9-e1b464619fa6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceZeroLengthSplittingCurve Property

Curve element with zero length cannot be used as a splitter and ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceZeroLengthSplittingCurve { get; }
```